controllers/IndexController.php

SELECT COUNT(*) FROM `user`
SELECT * FROM `user` LIMIT 5
---
    public function actionIndex(){

        $list = User::find();

        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' =>     $list->count(),
        ]);

        $countries = $list
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `user` WHERE `id`='1 1'
---
    public function actionUpdate()
    {
        $id = Yii::$app->request->get('id');
        $model = User::find()->where(['id' => $id])->one();
        $model1 = User::findOne($id);